In [ ]:
# 9 WEEK
# 9.1 Exercises on joining data tables

In [2]:
pip install matplotlib

^C
Note: you may need to restart the kernel to use updated packages.

In [3]:
# 1. program to join two data tables along columns from the dataset using ‘merge( ) function.
import pandas as pd
url = 'https://github.com/17rsuraj/data-curious/raw/master/TowardsDataScience/Dummy_course_data.xlsx'
df1 = pd.read_excel(url, sheet_name='Fees') 
df2 = pd.read_excel(url, sheet_name='Discounts') 
result = pd.merge(df1, df2, on='Country', how='inner') 
print(result)

             Course_x         Country  Fee_USD                Course_y  \
0               Maths           India    15500                   Maths
1               Maths           India    15500               Marketing
2            Politics           India    21600                   Maths
3            Politics           India    21600               Marketing
4             Physics         Germany    16700                 Physics
5             Physics         Germany    16700         German language
6       Applied Maths         Germany    11100                 Physics
7       Applied Maths         Germany    11100         German language
8     General Science  United Kingdom    18000  Information Technology
9      Social Science         Austria    18400          Social Science
10            History          Poland    23000                 History
11  Computer Graphics   United States    27000       Computer Graphics

    Discount_USD
0           1000
1           2000
2           1000
3           2000
4           2300
5           1500
6           2300
7           1500
8           1200
9           1500
10          3200
11          2500

In [4]:
# 2. a program to join two data tables along rows from the dataset using ‘join( ) function.
import pandas as pd
url = 'https://github.com/17rsuraj/data-curious/raw/master/TowardsDataScience/Dummy_course_data.xlsx'
df1 = pd.read_excel(url, sheet_name='Fees') 
df2 = pd.read_excel(url, sheet_name='Discounts')  
result = df1.join(df2, lsuffix='_df1', rsuffix='_df2')
print(result)

          Course_df1     Country_df1  Fee_USD              Course_df2  \
0              Maths           India    15500                   Maths
1            Physics         Germany    16700                 Physics
2      Applied Maths         Germany    11100         German language
3    General Science  United Kingdom    18000  Information Technology
4     Social Science         Austria    18400          Social Science
5            History          Poland    23000                 History
6           Politics           India    21600               Marketing
7  Computer Graphics   United States    27000       Computer Graphics

      Country_df2  Discount_USD
0           India          1000
1         Germany          2300
2         Germany          1500
3  United Kingdom          1200
4         Austria          1500
5          Poland          3200
6           India          2000
7   United States          2500

In [5]:
# 1. Write a program to create a Pivot table with multiple indexes from the data set of
import pandas as pd
url = 'https://github.com/ven-27/datasets/raw/master/titanic.csv'
titanic_data = pd.read_csv(url)
pivot_table = pd.pivot_table(titanic_data, 
                              index=['Pclass', 'Sex'], 
                              values=['Survived'], 
                              aggfunc={'Survived': 'mean'})
print(pivot_table)

               Survived
Pclass Sex
1      female  0.968085
       male    0.368852
2      female  0.921053
       male    0.157407
3      female  0.500000
       male    0.135447

In [6]:
# 2. a program to create a Pivot table on the given dataset and find survival rate by gender.
import pandas as pd
url = 'https://github.com/ven-27/datasets/raw/master/titanic.csv'
titanic_data = pd.read_csv(url)
pivot_table = pd.pivot_table(titanic_data, 
                              index='Sex', 
                              values='Survived', 
                              aggfunc='mean')
print(pivot_table)

        Survived
Sex
female  0.742038
male    0.188908

In [7]:
# 3. program to create a Pivot table on the given dataset and find survival rate by gender, age wiseof various classes.
import pandas as pd
url = 'https://github.com/ven-27/datasets/raw/master/titanic.csv'
titanic_data = pd.read_csv(url)
pivot_table = pd.pivot_table(titanic_data, 
                              index=['Sex', pd.cut(titanic_data['Age'], [0, 18, 35, 60, 100])], 
                              columns='Pclass', 
                              values='Survived', 
                              aggfunc='mean')
print(pivot_table)

Pclass                   1         2         3
Sex    Age
female (0, 18]    0.909091  1.000000  0.511628
       (18, 35]   0.972222  0.925000  0.500000
       (35, 60]   0.972222  0.850000  0.142857
       (60, 100]  1.000000       NaN  1.000000
male   (0, 18]    0.800000  0.600000  0.215686
       (18, 35]   0.500000  0.074074  0.155844
       (35, 60]   0.370370  0.037037  0.068182
       (60, 100]  0.083333  0.333333  0.000000

In [8]:
# 4. program to create a Pivot table on the given dataset and calculate number of women and men were in a particular cabin class.
import pandas as pd
url = 'https://github.com/ven-27/datasets/raw/master/titanic.csv'
titanic_data = pd.read_csv(url)
pivot_table = pd.pivot_table(titanic_data, 
                              index='Pclass', 
                              columns='Sex', 
                              values='PassengerId', 
                              aggfunc='count', 
                              margins=True,
                              margins_name='Total')
print(pivot_table)

Sex     female  male  Total
Pclass
1           94   122    216
2           76   108    184
3          144   347    491
Total      314   577    891

In [9]:
# 1. program to make a contingency table between the ‘Age’ and ‘Survived’ columns on the above dataset.
import pandas as pd
url = 'https://github.com/ven-27/datasets/raw/master/titanic.csv'
titanic_data = pd.read_csv(url)
contingency_table = pd.crosstab(index=pd.cut(titanic_data['Age'], [0, 18, 35, 60, 100]),
                                columns=titanic_data['Survived'],
                                margins=True,
                                margins_name='Total')

# Display the result
print(contingency_table)

Survived     0    1  Total
Age
(0, 18]     69   70    139
(18, 35]   221  137    358
(35, 60]   117   78    195
(60, 100]   17    5     22
Total      424  290    714

In [10]:
# 2.a program to make a contingency table between the ‘Pclass’ and ‘Sex’ columns
import pandas as pd
url = 'https://github.com/ven-27/datasets/raw/master/titanic.csv'
titanic_data = pd.read_csv(url)
contingency_table = pd.crosstab(index=titanic_data['Pclass'],
                                columns=titanic_data['Sex'],
                                margins=True,
                                margins_name='Total')
print(contingency_table)

Sex     female  male  Total
Pclass
1           94   122    216
2           76   108    184
3          144   347    491
Total      314   577    891

In [11]:
# 3. a program to make a contingency table between the ‘PassengerId’ + ‘Sex’ and ‘Survived’ columns
import pandas as pd
url = 'https://github.com/ven-27/datasets/raw/master/titanic.csv'
titanic_data = pd.read_csv(url)
contingency_table = pd.crosstab(index=[titanic_data['PassengerId'], titanic_data['Sex']],
                                columns=titanic_data['Survived'],
                                margins=True,
                                margins_name='Total')
print(contingency_table)

Survived              0    1  Total
PassengerId Sex
1           male      1    0      1
2           female    0    1      1
3           female    0    1      1
4           female    0    1      1
5           male      1    0      1
...                 ...  ...    ...
888         female    0    1      1
889         female    1    0      1
890         male      0    1      1
891         male      1    0      1
Total               549  342    891

[892 rows x 3 columns]

In [12]:
# 1. program to split the above dataset into groups based on passenger class and also check the type of GroupBy ( ) object.
import pandas as pd
url = 'https://github.com/ven-27/datasets/raw/master/titanic.csv'
titanic_data = pd.read_csv(url)
grouped_data = titanic_data.groupby('Pclass')
print(type(grouped_data))
for name, group in grouped_data:
    print(f'\nGroup: {name}')
    print(group.head())

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

Group: 1
    PassengerId  Survived  Pclass  \
1             2         1       1
3             4         1       1
6             7         0       1
11           12         1       1
23           24         1       1

                                                 Name     Sex   Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                             McCarthy, Mr. Timothy J    male  54.0      0
11                           Bonnell, Miss. Elizabeth  female  58.0      0
23                       Sloper, Mr. William Thompson    male  28.0      0

    Parch    Ticket     Fare Cabin Embarked
1       0  PC 17599  71.2833   C85        C
3       0    113803  53.1000  C123        S
6       0     17463  51.8625   E46        S
11      0    113783  26.5500  C103        S
23      0    113788  35.5000    A6        S

Group: 2
    PassengerId  Survived  Pclass                                 Name  \
9            10         1       2  Nasser, Mrs. Nicholas (Adele Achem)
15           16         1       2     Hewlett, Mrs. (Mary D Kingcome)
17           18         1       2         Williams, Mr. Charles Eugene
20           21         0       2                 Fynney, Mr. Joseph J
21           22         1       2                Beesley, Mr. Lawrence

       Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
9   female  14.0      1      0  237736  30.0708   NaN        C
15  female  55.0      0      0  248706  16.0000   NaN        S
17    male   NaN      0      0  244373  13.0000   NaN        S
20    male  35.0      0      0  239865  26.0000   NaN        S
21    male  34.0      0      0  248698  13.0000   D56        S

Group: 3
   PassengerId  Survived  Pclass                            Name     Sex  \
0            1         0       3         Braund, Mr. Owen Harris    male
2            3         1       3          Heikkinen, Miss. Laina  female
4            5         0       3        Allen, Mr. William Henry    male
5            6         0       3                Moran, Mr. James    male
7            8         0       3  Palsson, Master. Gosta Leonard    male

    Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0  22.0      1      0         A/5 21171   7.2500   NaN        S
2  26.0      0      0  STON/O2. 3101282   7.9250   NaN        S
4  35.0      0      0            373450   8.0500   NaN        S
5   NaN      0      0            330877   8.4583   NaN        Q
7   2.0      3      1            349909  21.0750   NaN        S

In [13]:
# 2.  program to split the above dataframe into groups based on survived and passenger class.
import pandas as pd
url = 'https://github.com/ven-27/datasets/raw/master/titanic.csv'
titanic_data = pd.read_csv(url)
grouped_data = titanic_data.groupby(['Survived', 'Pclass'])
print(type(grouped_data))
for name, group in grouped_data:
    print(f'\nGroup: {name}')
    print(group.head())

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

Group: (0, 1)
    PassengerId  Survived  Pclass                            Name   Sex   Age  \
6             7         0       1         McCarthy, Mr. Timothy J  male  54.0
27           28         0       1  Fortune, Mr. Charles Alexander  male  19.0
30           31         0       1        Uruchurtu, Don. Manuel E  male  40.0
34           35         0       1         Meyer, Mr. Edgar Joseph  male  28.0
35           36         0       1  Holverson, Mr. Alexander Oskar  male  42.0

    SibSp  Parch    Ticket      Fare        Cabin Embarked
6       0      0     17463   51.8625          E46        S
27      3      2     19950  263.0000  C23 C25 C27        S
30      0      0  PC 17601   27.7208          NaN        C
34      1      0  PC 17604   82.1708          NaN        C
35      1      0    113789   52.0000          NaN        S

Group: (0, 2)
    PassengerId  Survived  Pclass  \
20           21         0       2
33           34         0       2
41           42         0       2
70           71         0       2
72           73         0       2

                                                 Name     Sex   Age  SibSp  \
20                               Fynney, Mr. Joseph J    male  35.0      0
33                              Wheadon, Mr. Edward H    male  66.0      0
41  Turpin, Mrs. William John Robert (Dorothy Ann ...  female  27.0      1
70                         Jenkin, Mr. Stephen Curnow    male  32.0      0
72                               Hood, Mr. Ambrose Jr    male  21.0      0

    Parch        Ticket  Fare Cabin Embarked
20      0        239865  26.0   NaN        S
33      0    C.A. 24579  10.5   NaN        S
41      0         11668  21.0   NaN        S
70      0    C.A. 33111  10.5   NaN        S
72      0  S.O.C. 14879  73.5   NaN        S

Group: (0, 3)
    PassengerId  Survived  Pclass                            Name   Sex   Age  \
0             1         0       3         Braund, Mr. Owen Harris  male  22.0
4             5         0       3        Allen, Mr. William Henry  male  35.0
5             6         0       3                Moran, Mr. James  male   NaN
7             8         0       3  Palsson, Master. Gosta Leonard  male   2.0
12           13         0       3  Saundercock, Mr. William Henry  male  20.0

    SibSp  Parch     Ticket     Fare Cabin Embarked
0       1      0  A/5 21171   7.2500   NaN        S
4       0      0     373450   8.0500   NaN        S
5       0      0     330877   8.4583   NaN        Q
7       3      1     349909  21.0750   NaN        S
12      0      0  A/5. 2151   8.0500   NaN        S

Group: (1, 1)
    PassengerId  Survived  Pclass  \
1             2         1       1
3             4         1       1
11           12         1       1
23           24         1       1
31           32         1       1

                                                 Name     Sex   Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
11                           Bonnell, Miss. Elizabeth  female  58.0      0
23                       Sloper, Mr. William Thompson    male  28.0      0
31     Spencer, Mrs. William Augustus (Marie Eugenie)  female   NaN      1

    Parch    Ticket      Fare Cabin Embarked
1       0  PC 17599   71.2833   C85        C
3       0    113803   53.1000  C123        S
11      0    113783   26.5500  C103        S
23      0    113788   35.5000    A6        S
31      0  PC 17569  146.5208   B78        C

Group: (1, 2)
    PassengerId  Survived  Pclass                                      Name  \
9            10         1       2       Nasser, Mrs. Nicholas (Adele Achem)
15           16         1       2          Hewlett, Mrs. (Mary D Kingcome)
17           18         1       2              Williams, Mr. Charles Eugene
21           22         1       2                     Beesley, Mr. Lawrence
43           44         1       2  Laroche, Miss. Simonne Marie Anne Andree

       Sex   Age  SibSp  Parch         Ticket     Fare Cabin Embarked
9   female  14.0      1      0         237736  30.0708   NaN        C
15  female  55.0      0      0         248706  16.0000   NaN        S
17    male   NaN      0      0         244373  13.0000   NaN        S
21    male  34.0      0      0         248698  13.0000   D56        S
43  female   3.0      1      2  SC/Paris 2123  41.5792   NaN        C

Group: (1, 3)
    PassengerId  Survived  Pclass  \
2             3         1       3
8             9         1       3
10           11         1       3
19           20         1       3
22           23         1       3

                                                 Name     Sex   Age  SibSp  \
2                              Heikkinen, Miss. Laina  female  26.0      0
8   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
10                    Sandstrom, Miss. Marguerite Rut  female   4.0      1
19                            Masselmani, Mrs. Fatima  female   NaN      0
22                        McGowan, Miss. Anna "Annie"  female  15.0      0

    Parch            Ticket     Fare Cabin Embarked
2       0  STON/O2. 3101282   7.9250   NaN        S
8       2            347742  11.1333   NaN        S
10      1           PP 9549  16.7000    G6        S
19      0              2649   7.2250   NaN        C
22      0            330923   8.0292   NaN        Q

In [14]:
#  3. program to split the above dataframe into groups based on single column and multiple columns. Find the size of the grouped data.
multiple_columns_grouped = titanic_data.groupby(['Survived', 'Pclass'])
multiple_columns_group_sizes = multiple_columns_grouped.size()
print("\nGroup sizes based on multiple columns:")
print(multiple_columns_group_sizes)

Group sizes based on multiple columns:
Survived  Pclass
0         1          80
          2          97
          3         372
1         1         136
          2          87
          3         119
dtype: int64